<template>
    <ion-page>
        <ion-content :fullscreen="true">
            <flow-form ref="flowform" v-on:complete="onComplete" v-bind:language="language" v-bind:progressbar="false"
                v-bind:standalone="true">
                <question v-for="(question, index) in questions" v-bind="question" v-bind:key="'m' + index"
                    v-model="question.model">
                </question>

                <!-- Custom content for the Complete/Submit screen slots in the FlowForm component -->
                <template v-slot:complete>
                    <div class="f-section-wrap">
                        <div v-if="1 < 2">
                            <div v-if="loading">
                                <span class="fh2">Пожалуйста, подождите: сервер анализирует ваши ответ...</span>
                            </div>
                            <div v-else>
                                <div v-if="finalScore >= 285">
                                    <span class="fh2">Результат по шкале: {{ finalScore }} (выше среднего)</span>
                                    <div style="border: 1px solid #ccc!important; border-radius: 10px; margin-right: 20%;">
                                        <div style="background-color:green;height:24px;width:88%; border-radius: 10px;">
                                        </div>
                                    </div>
                                    <p class="f-description" style="margin-top: 15px;"><span>По разработанной нами шкалой,
                                            ваш результат выше среднего (бывают следующие категории: выше среднего, среднее,
                                            ниже среднего). Используется эксклюзивная шкала Арама <i>(автор)</i>, которая
                                            включает в себя шкалы SPARQTools.org Measuring Mobility toolkit, Oxford Anxiety
                                            Scale и некоторые другие. Данная шкала позволяет определить аспекты вашего
                                            психологического, эмоционального состояния, но и не только. Макисмальный балл по
                                            шкале - 399. Однако, вовсе не нужно набирать максимум, чтобы чувствовать себя
                                            великолепно.</span></p>
                                </div>
                                <div v-else-if="finalScore >= 195">
                                    <span class="fh2">Результат по шкале: {{ finalScore }} (среднее)</span>
                                    <div style="border: 1px solid #ccc!important; border-radius: 10px; margin-right: 20%;">
                                        <div style="background-color:orange;height:24px;width:68%; border-radius: 10px;">
                                        </div>
                                    </div>
                                    <p class="f-description" style="margin-top: 15px;"><span>По разработанной нами шкалой,
                                            ваш результат равен среднему (бывают следующие категории: выше среднего,
                                            среднее, ниже среднего). Используется эксклюзивная шкала Арама <i>(автор)</i>,
                                            которая включает в себя шкалы SPARQTools.org Measuring Mobility toolkit, Oxford
                                            Anxiety Scale и некоторые другие. Данная шкала позволяет определить аспекты
                                            вашего психологического, эмоционального состояния, но и не только. Макисмальный
                                            балл по шкале - 399. Однако, вовсе не нужно набирать максимум, чтобы чувствовать
                                            себя великолепно.</span></p>
                                </div>
                                <div v-else-if="finalScore >= 0">
                                    <span class="fh2">Результат по шкале: {{ finalScore }} (ниже среднего)</span>
                                    <div style="border: 1px solid #ccc!important; border-radius: 10px; margin-right: 20%;">
                                        <div style="background-color: darkred;height:24px;width:48%; border-radius: 10px;">
                                        </div>
                                    </div>
                                    <p class="f-description" style="margin-top: 15px;"><span>По разработанной нами шкалой,
                                            ваш результат ниже среднего (бывают следующие категории: выше среднего, среднее,
                                            ниже среднего). Используется эксклюзивная шкала Арама <i>(автор)</i>, которая
                                            включает в себя шкалы SPARQTools.org Measuring Mobility toolkit, Oxford Anxiety
                                            Scale и некоторые другие. Данная шкала позволяет определить аспекты вашего
                                            психологического, эмоционального состояния, но и не только. Макисмальный балл по
                                            шкале - 399. Однако, вовсе не нужно набирать максимум, чтобы чувствовать себя
                                            великолепно.</span></p>
                                </div><br />
                                <span style="font-size: 14px; !important;">
                                    The Autonomy subscale: {{ scores_detailed.autonomy_subscale_score }} <br />
                                    Environmental Mastery subscale: {{
                                        scores_detailed.environmental_mastery_subscale_score }}<br />
                                    The Personal Growth subscale: {{ scores_detailed.personal_growth_subscale_score }}<br />
                                    Positive Relations with Others subscale:
                                    {{ scores_detailed.positive_relations_subscale_score }}<br />
                                    The Purpose in Life subscale: {{ scores_detailed.purpose_in_life_subscale_score }}<br />
                                    The Self-Acceptance subscale: {{ scores_detailed.self_acceptance_subscale_score }}<br />
                                    Aram's Additional subscale: {{ scores_detailed.arams_subscale_score }}<br /><br /><br />
                                </span>
                            </div>
                        </div>
                    </div>
                </template>
                <!-- We've overriden the default "complete" slot content -->
                <template v-slot:completeButton>
                    <div class="f-submit">
                        <!-- Leave empty to hide default submit button -->
                    </div>
                </template>
            </flow-form>
        </ion-content>
    </ion-page>
</template>

<style scoped>
rion-content {
    background: linear-gradient(to bottom, rgba(0, 0, 0, 0.121) 10%, rgba(2, 156, 12, 0.714)), url('https://images.unsplash.com/photo-1586078074298-05dca4848695?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1935&q=80') !important;
    background-position: 100%;
    background-size: cover !important;
}

.vff ul.f-radios li {
    border-radius: 20px !important;
}
</style>
  
<script lang="ts">
import { defineComponent } from 'vue';
import { IonPage, IonContent } from '@ionic/vue';
import { FlowForm, Question, QuestionModel, QuestionType, ChoiceOption, LanguageModel } from '@ditdot-dev/vue-flow-form'

import globaldata from '../../modules/global';

export default defineComponent({
    name: 'Tab1Page',
    components: { IonContent, IonPage, FlowForm, Question },
    mounted() {
        const tabsEl = document.querySelector('ion-tab-bar');
        if (tabsEl) {
            tabsEl.hidden = true;
            tabsEl.style.height = "1";
        }
    },
    data() {
        return {
            finalScore: 0,
            loading: false,
            scores_detailed: {
                autonomy_subscale_score: 0,
                environmental_mastery_subscale_score: 0,
                personal_growth_subscale_score: 0,
                positive_relations_subscale_score: 0,
                purpose_in_life_subscale_score: 0,
                self_acceptance_subscale_score: 0,
                arams_subscale_score: 0
            },
            premadeoptions_1: [
                {
                    label: 'Почти всегда',
                    value: 'almost_always'
                },
                {
                    label: 'Иногда/изредка',
                    value: 'sometimes'
                },
                {
                    label: 'Очень редко',
                    value: 'very_seldom'
                }
            ],
            completed: false,
            language: new LanguageModel({
                pressEnter: "",
                continue: "дальше",
                submit: "отправить"
            }),
            questions: [
                {
                    type: 'sectionbreak',
                    id: 'intro1',
                    tagline: 'Промежуточный тест',
                    subtitle: "Мы приглашаем вас пройти промежуточный тест, который поможет нам определить ваше текущее психологическое и эмоциональное состояние, а также другие важные аспекты вашей жизни. Ваши ответы на этот тест будут ценными данными, которые помогут нам более глубоко понять влияние медитации на ваше благополучие. Спасибо еще раз за ваше участие! Давайте начнем тестирование и вместе продвинемся в наших исследованиях.",
                    title: '👋, вы готовы?',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [

                    ],
                    model: '',
                },
                {
                    type: 'sectionbreak',
                    id: 'intro2',
                    tagline: 'Промежуточный тест',
                    subtitle: "Уже почти начинаем! Расслабьтесь во время прохождения теста. Наверное, тест удобнее всего будет проходить лежа в кровати, если хочется перекусить - захватывайте печенья и кофе с собой, когда будете готовы - нажмите Начать.",
                    title: 'Пусть вам будет удобно',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [

                    ],
                    model: '',
                },
                {
                    type: 'sectionbreak',
                    id: 'intro3',
                    tagline: 'Промежуточный тест',
                    subtitle: "Сейчас перед вами будут появляться вопросы, но в формате суждений. Ваша задача в том, чтобы определить, насколько это суждение относится к вам. Когда будете думать над ответом, берите во внимание последние два дня - важно именно то, насколько это суждение подходит к вам за последние два дня (не нужно вспоминать как вы себя чувствовать месяц назад). У каждого суждения есть варианты ответов, которые обозначают степень согласия. Например, 'очень согласен', 'согласен', 'скорее не согласен' и так далее в этом роде. Старайтесь оценивать как можно точнее. Иногда участники выбирают вариант 'согласен' во многих вопросах. Поэтому вот что хотим сказать: мы даем вам выбор из 7 степеней согласия, старайтесь использовать их все. ",
                    title: 'Как проходить тест',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [

                    ],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q1',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я не боюсь высказывать свое мнение, даже если оно противоречит мнению большинства людей.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q2',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Для меня жизнь - это непрерывный процесс обучения, изменения и роста.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q3',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'В целом, мне кажется, что я контролирую ситуацию, в которой живу.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q4',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Люди описали бы меня как отзывчивого человека, готового поделиться своим временем с другими.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q5',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Меня не интересуют занятия, которые расширяют мой кругозор и горизонты моего видения.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q6',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне нравится строить планы на будущее и работать над их воплощением в жизнь.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q7',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Большинство людей считают меня любящим и ласковым.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q8',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Во многом я чувствую разочарование в своих достижениях в жизни.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q9',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я живу одним днем и не задумываюсь о будущем.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q10',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне свойственно часто беспокоиться о том, что думают обо мне другие люди.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q11',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Когда я смотрю на историю своей жизни, я доволен тем, как все сложилось.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q12',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне трудно выстроить свою жизнь таким образом, чтобы она приносила мне удовлетворение.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q13',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мои решения обычно не зависят от того, что все делают все остальные.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q14',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я уже давно отказался от попыток что-то изменить в своей жизни.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q15',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Требования повседневной жизни часто меня расстраивают.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q16',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'У меня было не так много теплых и доверительных отношений с другими людьми.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q17',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я думаю, что важно получать новый опыт, который меняет ваше представление о себе и мире.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q18',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Поддержание близких отношений было связано для меня с трудностями и разочарованиями.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q19',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мое отношение к себе, вероятно, не такое позитивное, как у большинства людей.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q20',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я ощущаю направленность и смысл своей жизни.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q21',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я оцениваю себя исходя из того, что я считаю важным, а не исходя из того, что считают важным другие люди.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q22',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'В целом, я чувствую себя уверенно и позитивно.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q23',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я смог создать для себя окружающую среду и образ жизни, которые мне приносят огромное удовлетворение.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q24',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я склонен поддаваться влиянию людей с ярко выраженными мнениями.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q25',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне не нравится находиться в новых ситуациях, требующих изменения моих привычных способов делать вещи.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q26',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я не очень хорошо вписываюсь в окружающих меня людей и общество.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q27',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я знаю, что могу доверять своим друзьям, и они знают, что могут мне доверять.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q28',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Когда я задумываюсь и анализирую свою жизнь, мне кажется, что я действительно не сильно прогрессировал как личность за все эти годы.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q29',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Некоторые люди бродят бесцельно по жизни, но я не из их числа.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q30',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я часто чувствую себя одиноко, потому что у меня мало близких друзей, с которыми можно поделиться своими проблемами.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q31',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Когда я сравниваю себя со своими друзьями и знакомыми то понимаю, что я во многом лучше их.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q32',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'У меня нет понимания того, чего я хочу достичь в жизни.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q33',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне иногда кажется, что я уже совершил в жизни все, что было можно.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q34',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне кажется, что многие из тех, кого я знаю, получили от жизни больше, чем я.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q35',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я уверен в своем мнении, даже если оно противоречит мнению большинства. ',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q36',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я довольно хорошо справляюсь с множеством своих ежедневных обязанностей.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q37',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'У меня есть ощущение, что за прошедшее время я очень сильно развился как личность.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q38',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я люблю задушевные беседы с родными или друзьями.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q39',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мои повседневные дела часто кажутся мне банальными и незначительными.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q40',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне нравится большая часть моей личности. В целом, я себе нравлюсь.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q41',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне трудно высказывать свое мнение по спорным вопросам.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q42',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я часто чувствую себя перегруженным своими обязанностями.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q43',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне приятно думать о том, что я совершил в прошлом и надеюсь совершить в будущем.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q44',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'В принципе, я считаю, что со временем узнаю о себе все больше и больше.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q45',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'В целом я уверен в себе.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q46',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я отношусь к тем людям, которым нравится пробовать все новое.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q47',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я чувствую себя хорошо.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q48',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я чувствую себя нервозным, тревожным или напряженным.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q49',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я не могу остановить или контролировать свои беспокойства.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q50',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я слишком много беспокоюсь о разных вещах.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q51',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'У меня проблемы с расслаблением.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q52',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Мне так беспокойно, что трудно сидеть спокойно.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q53',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я легко раздражаюсь или становлюсь раздражительным.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q54',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я чувствую страх или думают иногда о чем-то таком, будто что-то ужасное может произойти.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q55',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'У меня нет особенно счастливых воспоминаний о прошлом.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q56',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Я не получаю удовольствия от общения с другими людьми. ',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'multiplechoice',
                    id: 'Q57',
                    tagline: 'Выберите, насколько верно для вас представленное утверждение.',
                    title: 'Сегодня я счастлив! Йоу!',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    options: [{
                        label: 'Полностью согласен',
                        value: '1'
                    },
                    {
                        label: 'Умеренно согласен',
                        value: '2'
                    },
                    {
                        label: 'Слегка согласен',
                        value: '3'
                    },
                    {
                        label: 'Ни «не согласен», но и не «согласен»',
                        value: '4'
                    },
                    {
                        label: 'Слегка не согласен',
                        value: '5'
                    },
                    {
                        label: 'Умеренно не согласен',
                        value: '6'
                    },
                    {
                        label: 'Абсолютно не согласен',
                        value: '7'
                    }],
                    model: '',
                },
                {
                    type: 'sectionbreak',
                    id: 'review',
                    tagline: 'Больше спасибо за ваши ответы и то, что уделили время. Теперь нажмите на кнопку ниже, чтобы отправить их.',
                    title: 'Спасибо.',
                    multiple: false,
                    required: true,
                    helpTextShow: false,
                    model: '',
                },
            ]
        }
    },
    methods: {
        resendhttpdata(payload) {
            // eslint-disable-next-line
            var parent_this = this;

            this.$http.post(globaldata.api.hostname + "research/savesurveydata",
                JSON.stringify(payload), {
                    validateStatus: null,
                headers: {
                    'Content-Type': 'application/json',
                }
            }
            ).then(response => {
                console.log('Submit Success', response)

                if (response.status != 200) {
                    setTimeout(() => {
                        parent_this.resendhttpdata(payload)
                    }, 5000);
                }

                //if(localStorage.getItem("user_email")){
                //    this.show_ratebox_boolean = true;
                //}else{
                //    this.message_modal_isOpen = "result_askforemail"
                //}
            }).catch(e => {
                console.log('Submit Fail', e)
                setTimeout(() => {
                    this.resendhttpdata(payload)
                }, 5000);
            });
        },
        /* eslint-disable-next-line no-unused-vars */
        onComplete(completed, questionList) {
            // This method is called whenever the "completed" status is changed.
            this.completed = completed
            // Set `submitted` to true so the form knows not to allow back/forward
            // navigation anymore.
            //!!! this.$refs.flowform.submitted = true
            this.onSendData()
        },

        onSendData() {
            // eslint-disable-next-line
            const self = this
            const data = this.getData()

            //console.log(JSON.stringify(data))

            this.loading = true

            /*
              You can use Fetch API to send the data to your server, eg.:
              fetch(url, {
                method: 'POST',
                headers: {
                  'Content-Type': 'application/json'
                },
                body: JSON.stringify(data)
              })
            */
            // eslint-disable-next-line
            var parent_this = this;

            this.$http.post(globaldata.api.hostname + "research/savesurveydata",
                JSON.stringify(data), {
                validateStatus: null,
                headers: {
                    'Content-Type': 'application/json',
                }
            }
            ).then(response => {
                console.log('Submit Success', response)

                if (response.status != 200) {
                    setTimeout(() => {
                        parent_this.resendhttpdata(data)
                    }, 5000);
                }

                setTimeout(() => {
                    self.loading = false
                }, 1500)

                //if(localStorage.getItem("user_email")){
                //    this.show_ratebox_boolean = true;
                //}else{
                //    this.message_modal_isOpen = "result_askforemail"
                //}
            }).catch(e => {
                console.log('Submit Fail', e)
                setTimeout(() => {
                    this.$http.post(globaldata.api.hostname + "research/savesurveydata",
                        JSON.stringify(data), {
                        headers: {
                            'Content-Type': 'application/json',
                        }
                    }
                    ).then(response => {
                        console.log('Submit Success', response)
                        if (response.status != 200) {
                            setTimeout(() => {
                                parent_this.resendhttpdata(data)
                            }, 5000);
                        }


                        setTimeout(() => {
                            self.loading = false
                        }, 1500)

                        //if(localStorage.getItem("user_email")){
                        //    this.show_ratebox_boolean = true;
                        //}else{
                        //    this.message_modal_isOpen = "result_askforemail"
                        //}
                    }).catch(e => {
                        console.log('Submit Fail', e)
                        setTimeout(() => {
                            parent_this.resendhttpdata(data)
                        }, 5000);
                        alert(e)
                    });
                }, 5000);
                alert(e)
            });



        },
        getData() {
            // eslint-disable-next-line
            var parent_this = this;

            var data = {
                questions_title: [],
                questions_id: [],
                answers: [],
                calculated_data: {
                    autonomy_subscale_score: 0,
                    environmental_mastery_subscale_score: 0,
                    personal_growth_subscale_score: 0,
                    positive_relations_subscale_score: 0,
                    purpose_in_life_subscale_score: 0,
                    self_acceptance_subscale_score: 0,
                    arams_subscale_score: 0,
                    overall_score: 0,
                    email: ""
                }
            }

            var autonomy_subscale_score = 0;
            var autonomy_questions_linked = ["Q1", "Q13", "Q24", "Q35", "Q41", "Q10", "Q21"];
            var environmental_mastery_subscale_score = 0;
            var environmental_mastery_questions_linked = ["Q3", "Q15", "Q26", "Q36", "Q42", "Q12", "Q23"];
            var personal_growth_subscale_score = 0;
            var personal_growth_questions_linked = ["Q5", "Q17", "Q28", "Q37", "Q2", "Q14", "Q25"];
            var positive_relations_subscale_score = 0;
            var positive_relations_questions_linked = ["Q7", "Q18", "Q30", "Q38", "Q4", "Q16", "Q27"];
            var purpose_in_life_subscale_score = 0;
            var purpose_in_life_questions_linked = ["Q9", "Q20", "Q32", "Q39", "Q6", "Q29", "Q33"];
            var self_acceptance_subscale_score = 0;
            var self_acceptance_questions_linked = ["Q11", "Q22", "Q34", "Q40", "Q8", "Q19", "Q31"];
            var arams_subscale_score = 0;
            var arams_questions_linked = ["Q43", "Q44", "Q45", "Q46", "Q47", "Q48", "Q49", "Q51", "Q52", "Q53", "Q54", "Q55"];


            this.questions.forEach(question => {
                var question_id = question.id;
                var question_score = 0;


                var QuestionsNeedReverse = ["Q1", "Q2", "Q3", "Q4", "Q6", "Q7", "Q11", "Q13", "Q17", "Q20", "Q21", "Q22", "Q23", "Q27", "Q29", "Q31", "Q35", "Q36", "Q37", "Q38", "Q40", "48", "49", "50", "51", "52", "53", "54", "55", "56",];

                //console.log('point1', QuestionsNeedReverse.includes(question_id))
                //console.log('point2', question_id)
                if (QuestionsNeedReverse.includes(question_id)) {
                    question_score = (7 + 1) - parseInt(question.model);
                } else {
                    question_score = parseInt(question.model);
                }
                //console.log('point3', question_score)
                //console.log('point4', question.model)

                //For the Autonomy subscale:

                if (autonomy_questions_linked.includes(question_id)) {
                    autonomy_subscale_score += question_score;
                }

                //For the Environmental Mastery subscale:

                if (environmental_mastery_questions_linked.includes(question_id)) {
                    environmental_mastery_subscale_score += question_score;
                }

                //For the Personal Growth subscale:

                if (personal_growth_questions_linked.includes(question_id)) {
                    personal_growth_subscale_score += question_score;
                }

                //For the Positive Relations with Others subscale:

                if (positive_relations_questions_linked.includes(question_id)) {
                    positive_relations_subscale_score += question_score;
                }

                //For the Purpose in Life subscale:

                if (purpose_in_life_questions_linked.includes(question_id)) {
                    purpose_in_life_subscale_score += question_score;
                }

                //For the Self - Acceptance subscale:

                if (self_acceptance_questions_linked.includes(question_id)) {
                    self_acceptance_subscale_score += question_score;
                }

                //For the Aram's Author Scale

                if (arams_questions_linked.includes(question_id)) {
                    arams_subscale_score += question_score;
                }






                if (question.title) {
                    let answer = question.model
                    if (Array.isArray(answer)) {
                        answer = answer.join(', ')
                    }
                    // eslint-disable-next-line
                    data.questions_id.push(question.id)
                    data.questions_title.push(question.title)
                    // eslint-disable-next-line
                    data.answers.push(answer)
                }
            })

            var overall_score = autonomy_subscale_score + environmental_mastery_subscale_score + personal_growth_subscale_score + positive_relations_subscale_score + purpose_in_life_subscale_score + self_acceptance_subscale_score + arams_subscale_score;
            parent_this.finalScore = overall_score;
            parent_this.scores_detailed = {
                autonomy_subscale_score: autonomy_subscale_score,
                environmental_mastery_subscale_score: environmental_mastery_subscale_score,
                personal_growth_subscale_score: personal_growth_subscale_score,
                positive_relations_subscale_score: positive_relations_subscale_score,
                purpose_in_life_subscale_score: purpose_in_life_subscale_score,
                self_acceptance_subscale_score: self_acceptance_subscale_score,
                arams_subscale_score: arams_subscale_score
            };

            const urlParams = new URLSearchParams(window.location.search);
            const email_param = urlParams.get('email');

            if (!urlParams.has('email')) {
                alert("Произошла ошибка (x*unable to find email address in query). Попробуйте еще раз перейти по ссылке. Если проблема не решается, напишите мне в Telegram: @aramtop или на support@deqstudio.com.")
            }

            data.calculated_data = {
                autonomy_subscale_score: autonomy_subscale_score,
                environmental_mastery_subscale_score: environmental_mastery_subscale_score,
                personal_growth_subscale_score: personal_growth_subscale_score,
                positive_relations_subscale_score: positive_relations_subscale_score,
                purpose_in_life_subscale_score: purpose_in_life_subscale_score,
                self_acceptance_subscale_score: self_acceptance_subscale_score,
                arams_subscale_score: arams_subscale_score,
                overall_score: overall_score,
                email: email_param
            };

            //console.log(data)

            //localStorage.setItem("stats_emotionalstate_atleast_once", "true")

            return data
        },
        goNext(event) {
            console.log("Going home!", event)
            this.$router.push({ path: '/tabs/hello', replace: true });
        }
    },
});
</script>

<style>
/* Import Vue Flow Form base CSS */
@import '~@ditdot-dev/vue-flow-form/dist/vue-flow-form.css';
/* Import one of the Vue Flow Form CSS themes (optional) */
/* @import '~@ditdot-dev/vue-flow-form/dist/vue-flow-form.theme-minimal.css'; */
/* @import '~@ditdot-dev/vue-flow-form/dist/vue-flow-form.theme-green.css'; */
@import '../../assets/css/quiz-flow.css';
</style>

<style scoped>
.vff {
    margin: 10vh 0 60px !important;
}
</style>
  